jgrivera67/McRTOS/src/BoardSupport/LM4F120-LaunchPad/lm4f120_soc_hardware_abstractions.c
/**
 * @file lm4f120_soc_hardware_abstractions.c
 *
 * Hardware abstraction layer for the TI Stellaris LM24F120 SoC
 *
 * @author German Rivera
 */

#include "hardware_abstractions.h"
#include "lm4f120_soc.h"
#include "launchpad_board.h"
#include "McRTOS_arm_cortex_m.h"
#include "failure_data_capture.h"
#include "utils.h"
#include "McRTOS_config_parameters.h"
#include "McRTOS_kernel_services.h"

#pragma GCC diagnostic ignored "-Wunused-parameter" //???
#pragma GCC diagnostic ignored "-Wunused-variable" //???

/**
 * Macro to generate dummy NVIC ISR functions
 */
#define GENERATE_DUMMY_NVIC_ISR_FUNCTION(_isr_function_name,                \
                                         _nvic_irq_number)                  \
        void                                                                \
        _isr_function_name(void)                                            \
        {                                                                   \
            /* This function should not have been invoked */                \
            FDC_ASSERT(false, _nvic_irq_number, 0);                         \
            FDC_ASSERT_INTERRUPT_SOURCE_IS_SET(_nvic_irq_number);           \
        }

/**
 * Serial communication parameters for the serial port used as the console
 * port
 */
#define CONSOLE_SERIAL_PORT_BAUD_RATE   115200
#define CONSOLE_SERIAL_PORT_MODE        0   /* 8-bits, no-parity, 1 stop bit */

#define UART_TRANSMIT_QUEUE_SIZE_IN_BYTES   UINT16_C(128)
#define UART_RECEIVE_QUEUE_SIZE_IN_BYTES    UINT16_C(16)

#define CALC_BAUD_RATE_DIVISOR_INT_PART(_cpu_clock_freq_hz, _baud_rate) \
	((_cpu_clock_freq_hz) / (16 * (_baud_rate)))

#define CALC_BAUD_RATE_DIVISOR_FRAC_PART(_cpu_clock_freq_hz, _baud_rate) \
	UINT_DIV_APPROX(						\
		((_cpu_clock_freq_hz) % (16 * (_baud_rate))) * 64,	\
		16 * (_baud_rate))

/**
 * Const fields of a UART device (to be placed in flash)
 */
struct uart_device {
#   define UART_DEVICE_SIGNATURE  GEN_SIGNATURE('U', 'A', 'R', 'T')
    uint32_t urt_signature;
    struct uart_device_var *urt_var_p;
    volatile struct uart *urt_mmio_uart_p;
    uint32_t urt_mmio_clock_gate_mask;
    volatile struct gpio_port *urt_gpio_port_p; /* for Tx and Rx pins */
    uint32_t urt_tx_pin_bit_index;
    uint32_t urt_rx_pin_bit_index;
    uint8_t urt_mux_function_selector;
    struct rtos_interrupt_registration_params urt_rtos_interrupt_params;
    struct rtos_interrupt **urt_rtos_interrupt_pp;
    const char *urt_transmit_queue_name_p;
    const char *urt_receive_queue_name_p;
    uint8_t *urt_transmit_queue_storage_p;
    uint8_t *urt_receive_queue_storage_p;
};


/**
 * Non-const fields of a UART device (to be placed in SRAM)
 */
struct uart_device_var {
    bool urt_initialized;
    uint32_t urt_received_bytes_dropped;
    uint32_t urt_transmit_bytes_dropped;
    struct rtos_circular_buffer urt_transmit_queue;
    struct rtos_circular_buffer urt_receive_queue;
};

static cpu_reset_cause_t find_reset_cause(void);

static void system_clocks_init(void);

#ifdef _CPU_CYCLES_MEASURE_
static void init_cpu_clock_cycles_counter(void);
#endif

static void uart_stop(
    const struct uart_device *uart_device_p);

/*
 * Function prototypes for dummy VIC interrupt ISRs
 */
static isr_function_t dummy_isr;

/**
 * Interrupt Vector Table
 */
isr_function_t *const g_interrupt_vector_table[] __attribute__ ((section(".vectortable"))) = {
    [INT_Initial_Stack_Pointer] = (void *)&g_cortex_m_exception_stack.es_stack_underflow_marker,

    /*
     * Processor exceptions
     */
    [INT_Initial_Program_Counter] = cortex_m_reset_handler,
    [INT_NMI] = cortex_m_nmi_isr,
    [INT_Hard_Fault] = cortex_m_hard_fault_exception_handler,
    [INT_SVCall] = cortex_m_svc_exception_handler,
    [INT_PendableSrvReq] = cortex_m_pendsv_exception_handler,
    [INT_SysTick] = cortex_m_systick_isr,

    /* Interrupts external to the Cortex-M core */
    [INT_GPIOA] = dummy_isr,          // GPIO Port A
    [INT_GPIOB] = dummy_isr,          // GPIO Port B
    [INT_GPIOC] = dummy_isr,          // GPIO Port C
    [INT_GPIOD] = dummy_isr,          // GPIO Port D
    [INT_GPIOE] = dummy_isr,          // GPIO Port E
    [INT_UART0] = lm4f120_uart0_isr,  // UART0
    [INT_UART1] = dummy_isr,          // UART1
    [INT_SSI0] = dummy_isr,          // SSI0
    [INT_I2C0] = dummy_isr,          // I2C0
    [INT_PWM0_FAULT] = dummy_isr,          // PWM0 Fault
    [INT_PWM0_0] = dummy_isr,          // PWM0 Generator 0
    [INT_PWM0_1] = dummy_isr,          // PWM0 Generator 1
    [INT_PWM0_2] = dummy_isr,          // PWM0 Generator 2
    [INT_QEI0] = dummy_isr,          // QEI0
    [INT_ADC0SS0] = dummy_isr,          // ADC0 Sequence 0
    [INT_ADC0SS1] = dummy_isr,          // ADC0 Sequence 1
    [INT_ADC0SS2] = dummy_isr,          // ADC0 Sequence 2
    [INT_ADC0SS3] = dummy_isr,          // ADC0 Sequence 3
    [INT_WATCHDOG] = dummy_isr,          // Watchdog Timers 0 and 1
    [INT_TIMER0A] = dummy_isr,          // 16/32-Bit Timer 0A
    [INT_TIMER0B] = dummy_isr,          // 16/32-Bit Timer 0B
    [INT_TIMER1A] = dummy_isr,          // 16/32-Bit Timer 1A
    [INT_TIMER1B] = dummy_isr,          // 16/32-Bit Timer 1B
    [INT_TIMER2A] = dummy_isr,          // 16/32-Bit Timer 2A
    [INT_TIMER2B] = dummy_isr,          // 16/32-Bit Timer 2B
    [INT_COMP0] = dummy_isr,          // Analog Comparator 0
    [INT_COMP1] = dummy_isr,          // Analog Comparator 1
    [INT_SYSCTL] = dummy_isr,          // System Control
    [INT_FLASH] = dummy_isr,          // Flash Memory Control and EEPROM
                                            // Control
    [INT_GPIOF] = dummy_isr,          // GPIO Port F
    [INT_UART2] = dummy_isr,          // UART2
    [INT_SSI1] = dummy_isr,          // SSI1
    [INT_TIMER3A] = dummy_isr,          // Timer 3A
    [INT_TIMER3B] = dummy_isr,          // Timer 3B
    [INT_I2C1] = dummy_isr,          // I2C1
    [INT_QEI1] = dummy_isr,          // QEI1
    [INT_CAN0] = dummy_isr,          // CAN0
    [INT_CAN1] = dummy_isr,          // CAN1
    [INT_HIBERNATE] = dummy_isr,          // Hibernation Module
    [INT_USB0] = dummy_isr,          // USB
    [INT_PWM0_3] = dummy_isr,          // PWM Generator 3
    [INT_UDMA] = dummy_isr,          // uDMA Software
    [INT_UDMAERR] = dummy_isr,          // uDMA Error
    [INT_ADC1SS0] = dummy_isr,          // ADC1 Sequence 0
    [INT_ADC1SS1] = dummy_isr,          // ADC1 Sequence 1
    [INT_ADC1SS2] = dummy_isr,          // ADC1 Sequence 2
    [INT_ADC1SS3] = dummy_isr,          // ADC1 Sequence 3
    [INT_SSI2] = dummy_isr,          // SSI2
    [INT_SSI3] = dummy_isr,          // SSI3
    [INT_UART3] = dummy_isr,          // UART3
    [INT_UART4] = dummy_isr,          // UART4
    [INT_UART5] = dummy_isr,          // UART5
    [INT_UART6] = dummy_isr,          // UART6
    [INT_UART7] = dummy_isr,          // UART7
    [INT_I2C2] = dummy_isr,          // I2C2
    [INT_I2C3] = dummy_isr,          // I2C3
    [INT_TIMER4A] = dummy_isr,          // 16/32-Bit Timer 4A
    [INT_TIMER4B] = dummy_isr,          // 16/32-Bit Timer 4B
    [INT_TIMER5A] = dummy_isr,         // 16/32-Bit Timer 5A
    [INT_TIMER5B] = dummy_isr,         // 16/32-Bit Timer 5B
    [INT_WTIMER0A] = dummy_isr,         // 32/64-Bit Timer 0A
    [INT_WTIMER0B] = dummy_isr,         // 32/64-Bit Timer 0B
    [INT_WTIMER1A] = dummy_isr,         // 32/64-Bit Timer 1A
    [INT_WTIMER1B] = dummy_isr,         // 32/64-Bit Timer 1B
    [INT_WTIMER2A] = dummy_isr,         // 32/64-Bit Timer 2A
    [INT_WTIMER2B] = dummy_isr,         // 32/64-Bit Timer 2B
    [INT_WTIMER3A] = dummy_isr,         // 32/64-Bit Timer 3A
    [INT_WTIMER3B] = dummy_isr,         // 32/64-Bit Timer 3B
    [INT_WTIMER4A] = dummy_isr,         // 32/64-Bit Timer 4A
    [INT_WTIMER4B] = dummy_isr,         // 32/64-Bit Timer 4B
    [INT_WTIMER5A] = dummy_isr,         // 32/64-Bit Timer 5A
    [INT_WTIMER5B] = dummy_isr,         // 32/64-Bit Timer 5B
    [INT_SYSEXC] = dummy_isr,         // System Exception (imprecise)
    [INT_PWM1_0] = dummy_isr,         // PWM1 Generator 0
    [INT_PWM1_1] = dummy_isr,         // PWM1 Generator 1
    [INT_PWM1_2] = dummy_isr,         // PWM1 Generator 2
    [INT_PWM1_3] = dummy_isr,         // PWM1 Generator 3
    [INT_PWM1_FAULT] = dummy_isr,         // PWM1 Fault
};

C_ASSERT(
    ARRAY_SIZE(g_interrupt_vector_table) ==
    CORTEX_M_IRQ_VECTOR_BASE + SOC_NUM_INTERRUPT_CHANNELS);

/**
 * McRTOS interrupt object for the UART0 interrupts
 */
struct rtos_interrupt *g_rtos_interrupt_uart0_p = NULL;

/**
 * Global array of non-const structures for UART devices
 * (allocated in SRAM space)
 */
static struct uart_device_var g_uart_devices_var[] =
{
    [0] = {
        .urt_initialized = false,
        .urt_received_bytes_dropped = 0,
        .urt_transmit_bytes_dropped = 0,
        },

    [1] = {
        .urt_initialized = false,
        .urt_received_bytes_dropped = 0,
        .urt_transmit_bytes_dropped = 0,
        },

