jgrivera67/McRTOS/src/BoardSupport/LM4F120-LaunchPad/lm4f120_soc_hardware_abstractions.c
    [2] = {
        .urt_initialized = false,
        .urt_received_bytes_dropped = 0,
        .urt_transmit_bytes_dropped = 0,
        },
};

static uint8_t uart0_transmit_queue_storage[UART_TRANSMIT_QUEUE_SIZE_IN_BYTES];
static uint8_t uart0_receive_queue_storage[UART_RECEIVE_QUEUE_SIZE_IN_BYTES];

/**
 * Global array of const structures for UART devices for the LM4F120 SoC
 * (allocated in flash space)
 */
static const struct uart_device g_uart_devices[] =
{
    [0] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[0],
        .urt_mmio_uart_p = (volatile struct uart *)UART0_BASE,
        .urt_mmio_clock_gate_mask = SYSCTL_RCGC1_UART0,
	.urt_gpio_port_p = (volatile struct gpio_port *)GPIO_PORTA_BASE,
	.urt_tx_pin_bit_index = LPAD_UART0_TX_PIN_INDEX,
	.urt_rx_pin_bit_index = LPAD_UART0_RX_PIN_INDEX,
	.urt_mux_function_selector = 0x1,
        .urt_rtos_interrupt_params = {
            .irp_name_p = "UART0 Interrupt",
            .irp_isr_function_p = lm4f120_uart0_isr,
            .irp_arg_p =  (void *)&g_uart_devices[0],
            .irp_channel = VECTOR_NUMBER_TO_IRQ_NUMBER(INT_UART0),
            .irp_priority = UART0_INTERRUPT_PRIORITY,
            .irp_cpu_id = 0,
        },

        .urt_rtos_interrupt_pp = &g_rtos_interrupt_uart0_p,
        .urt_transmit_queue_name_p = "UART0 transmit queue",
        .urt_receive_queue_name_p = "UART0 receive queue",
        .urt_transmit_queue_storage_p = uart0_transmit_queue_storage,
        .urt_receive_queue_storage_p = uart0_receive_queue_storage,
    },

    [1] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[1],
        .urt_mmio_uart_p = (volatile struct uart *)UART1_BASE,
        .urt_mmio_clock_gate_mask = SYSCTL_RCGC1_UART1,
	.urt_gpio_port_p = (volatile struct gpio_port *)GPIO_PORTC_BASE,
	.urt_tx_pin_bit_index = LPAD_UART1_TX_PIN_INDEX,
	.urt_rx_pin_bit_index = LPAD_UART1_RX_PIN_INDEX,
	.urt_mux_function_selector = 0x2,
    },

    [2] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[2],
        .urt_mmio_uart_p = (volatile struct uart *)UART2_BASE,
        .urt_mmio_clock_gate_mask = SYSCTL_RCGC1_UART2,
    },
};

C_ASSERT(
    ARRAY_SIZE(g_uart_devices) == ARRAY_SIZE(g_uart_devices_var));

const struct uart_device *const g_console_serial_port_p = &g_uart_devices[0];

/**
 * Hardware Micro trace buffer (MTB)
 */
#if 0
uint64_t __attribute__ ((section(".mtb_buf")))
    g_micro_trace_buffer[MICRO_TRACE_BUFFER_NUM_ENTRIES];
#endif

/**
 *  Initializes SoC hardware.
 *
 *  @pre This function must be called with interrupts disabled.
 */
cpu_reset_cause_t
soc_hardware_init(void)
{
    cpu_status_register_t reg_primask = __get_PRIMASK();

    FDC_ASSERT(
        CPU_INTERRUPTS_ARE_DISABLED(reg_primask),
        reg_primask, 0);

    cpu_reset_cause_t reset_cause = find_reset_cause();

    system_clocks_init();

#   ifdef _CPU_CYCLES_MEASURE_
    init_cpu_clock_cycles_counter();
#   endif

    bool mpu_present = cortex_m_mpu_init();

    cortex_m_nvic_init();

    uart_init(
        g_console_serial_port_p,
        CONSOLE_SERIAL_PORT_BAUD_RATE,
        CONSOLE_SERIAL_PORT_MODE);

#   ifdef DEBUG
    uart_putchar_with_polling(g_console_serial_port_p, '\r');
    uart_putchar_with_polling(g_console_serial_port_p, '\n');
    DEBUG_PRINTF("UART0 initialized\n");
    DEBUG_PRINTF("Last reset cause: %#x\n", reset_cause);
    DEBUG_PRINTF("MPU %s present\n", mpu_present ? "" : "not");
#   else
    uart_putchar(g_console_serial_port_p, '\r');
    uart_putchar(g_console_serial_port_p, '\n');
#   endif

#if 0
    i2c_init(g_i2c0_device_p);
#endif
    return reset_cause;
}


void
soc_reset(void)
{
    __disable_irq();

    /*
     * Stop all peripherals:
     */
    uart_stop(g_console_serial_port_p);

    /*
     * Trigger software reset in the SoC:
     */
    NVIC_SystemReset();
}


static cpu_reset_cause_t
find_reset_cause(void)
{
    return GRC_INVALID_RESET_CAUSE; // TODO
}


bool
software_reset_happened(void)
{
    return false; // TODO
}


/**
 * Configure the system to get its clock from the PLL
 */
static void
pll_init(void)
{
    /*
     * TODO: re-write this function
     */
#   define SYSDIV2 4
    // bus frequency is 400MHz/(SYSDIV2+1) = 400MHz/(4+1) = 80 MHz

  // 0) configure the system to use RCC2 for advanced features
  //    such as 400 MHz PLL and non-integer System Clock Divisor
  SYSCTL_RCC2_R |= SYSCTL_RCC2_USERCC2;
  // 1) bypass PLL while initializing
  SYSCTL_RCC2_R |= SYSCTL_RCC2_BYPASS2;
  // 2) select the crystal value and oscillator source
  SYSCTL_RCC_R &= ~SYSCTL_RCC_XTAL_M;   // clear XTAL field
  SYSCTL_RCC_R += SYSCTL_RCC_XTAL_16MHZ;// configure for 16 MHz crystal
  SYSCTL_RCC2_R &= ~SYSCTL_RCC2_OSCSRC2_M;// clear oscillator source field
  SYSCTL_RCC2_R += SYSCTL_RCC2_OSCSRC2_MO;// configure for main oscillator source
  // 3) activate PLL by clearing PWRDN
  SYSCTL_RCC2_R &= ~SYSCTL_RCC2_PWRDN2;
  // 4) set the desired system divider and the system divider least significant bit
  SYSCTL_RCC2_R |= SYSCTL_RCC2_DIV400;  // use 400 MHz PLL
  SYSCTL_RCC2_R = (SYSCTL_RCC2_R&~0x1FC00000) // clear system clock divider field
                  + (SYSDIV2<<22);      // configure for 80 MHz clock
  // 5) wait for the PLL to lock by polling PLLLRIS
  while((SYSCTL_RIS_R&SYSCTL_RIS_PLLLRIS)==0){};
  // 6) enable use of PLL by clearing BYPASS
  SYSCTL_RCC2_R &= ~SYSCTL_RCC2_BYPASS2;
}

static void
system_clocks_init(void)
{
    uint32_t reg_value;

    pll_init();

    /*
     * Enable all of the GPIO port clocks. These have to be enabled to configure
     * pin muxing options, so most code will need all of these on anyway.
     */
    reg_value = read_32bit_mmio_register(&SYSCTL_RCGC2_R);
    reg_value |= (SYSCTL_RCGC2_GPIOA |
		  SYSCTL_RCGC2_GPIOB |
		  SYSCTL_RCGC2_GPIOC |
		  SYSCTL_RCGC2_GPIOD |
		  SYSCTL_RCGC2_GPIOE |
		  SYSCTL_RCGC2_GPIOF);
    write_32bit_mmio_register(&SYSCTL_RCGC2_R, reg_value);
}

static bool g_micro_trace_initialized = false;

void
micro_trace_init(void)
{
}


void
micro_trace_stop(void)
{
    if (! g_micro_trace_initialized) {
        return;
    }
}


void
micro_trace_restart(void)
{
    if (! g_micro_trace_initialized) {
        return;
    }
}


void
micro_trace_get_cursor(uint64_t **mtb_cursor_pp, bool *mtb_cursor_wrapped_p)
{
    if (! g_micro_trace_initialized) {
        *mtb_cursor_pp = __micro_trace_buffer;
        *mtb_cursor_wrapped_p = false;
        return;
    }
}


