jgrivera67/McRTOS/src/BoardSupport/LM4F120-LaunchPad/lm4f120_soc_hardware_abstractions.c
#ifdef _CPU_CYCLES_MEASURE_
static void
init_cpu_clock_cycles_counter(void)
{
    /*
     * Enable the clock to the PIT Module
     */
    uint32_t reg_value = read_32bit_mmio_register(&SIM_SCGC6);
    reg_value |= SIM_SCGC6_PIT_MASK;
    write_32bit_mmio_register(&SIM_SCGC6, reg_value);

    /*
     * Turn on PIT
     *
     * Bit MIDS = 0: Clock for standard PIT timers is enabled
     * Bit FRZ = 1: Timers are stopped in Debug mode.
     */
    write_32bit_mmio_register(
        &PIT_MCR,
        PIT_MCR_FRZ_MASK);

    /*
     * Configure the lifetimer timer, by chaining timer 1 to timer 0,
     * and by setting the LDVAL register of each timer to the maximum value.
     * Each timer is a down counter. Interrupts are left disabled for both
     * timers.
     */
    write_32bit_mmio_register(&PIT_LDVAL0, 0xFFFFFFFF);
    write_32bit_mmio_register(&PIT_LDVAL1, 0xFFFFFFFF);

    /*
     * Bit CHN = 1: Timer 1 is chained to previous timer (timer 0).
     * Bit TIE = 0: Interrupt requests from Timer 1 are disabled.
     * Bit TEN = 1: Timer 1 is enabled.
     */
    write_32bit_mmio_register(
        &PIT_TCTRL1,
        PIT_TCTRL_CHN_MASK | PIT_TCTRL_TEN_MASK);

    /*
     * Bit CHN = 0: Timer 0 is not chained.
     * Bit TIE = 0: Interrupt requests from Timer 0 are disabled.
     * Bit TEN = 1: Timer 0 is enabled.
     */
    write_32bit_mmio_register(
        &PIT_TCTRL0,
        PIT_TCTRL_TEN_MASK);
}


uint64_t
get_cpu_clock_cycles64(void)
{
    uint32_t low_reg_value = read_32bit_mmio_register(&PIT_LTMR64L);
    uint32_t high_reg_value = read_32bit_mmio_register(&PIT_LTMR64H);

    return ((uint64_t)high_reg_value << 32) + low_reg_value;
}


uint32_t
get_cpu_clock_cycles(void)
{
    uint32_t low_reg_value = read_32bit_mmio_register(&PIT_LTMR64L);

    /*
     * TODO: PIT module frequency is half of the CPU frequency, so may
     * need to multiply by 2 to get the accurate number CPU clock cycles.
     */
    return low_reg_value * 2;
}
#endif /* _CPU_CYCLES_MEASURE_ */

/**
 * It configures a GPIO pin of the LM4F120 SoC
 */
void
configure_pin(const struct pin_config_info *pin_info_p, bool is_output)
{
    uint32_t reg_value;
    volatile struct gpio_port *pin_gpio_port_p = pin_info_p->pin_gpio_port_p;

#   ifdef DEBUG
    FDC_ASSERT(
        pin_info_p->pin_bit_mask <= 0xff,
        pin_info_p->pin_bit_mask, pin_info_p);
#   endif

    if (pin_info_p->pin_is_locked) {
	/*
	 * Unlock pin:
	 */
        write_32bit_mmio_register(
	    &pin_gpio_port_p->reg_LOCK, GPIO_LOCK_KEY);

        reg_value = read_32bit_mmio_register(
			    &pin_gpio_port_p->reg_CR);
        reg_value |= pin_info_p->pin_bit_mask;
        write_32bit_mmio_register(
	    &pin_gpio_port_p->reg_CR, reg_value);
    }

    /*
     * Set pin direction:
     */
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_DIR);
    if (is_output) {
        reg_value |= pin_info_p->pin_bit_mask;
    } else {
        reg_value &= ~pin_info_p->pin_bit_mask;
    }
    write_32bit_mmio_register(&pin_gpio_port_p->reg_DIR, reg_value);

    /*
     * Disable alternate function for pin:
     */
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_AFSEL);
    reg_value &= ~pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(&pin_gpio_port_p->reg_AFSEL, reg_value);
    ///???
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_PCTL);
    reg_value &= ~pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(&pin_gpio_port_p->reg_PCTL, reg_value);
    ///???

    switch (pin_info_p->pin_pull_mode) {
    case PIN_PULL_DOWN:
        reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_PDR);
        reg_value |= pin_info_p->pin_bit_mask;
        write_32bit_mmio_register(&pin_gpio_port_p->reg_PDR, reg_value);
	break;

    case PIN_PULL_UP:
	reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_PUR);
	reg_value |= pin_info_p->pin_bit_mask;
	write_32bit_mmio_register(&pin_gpio_port_p->reg_PUR, reg_value);
	break;

    case PIN_OPEN_DRAIN:
	reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_ODR);
	reg_value |= pin_info_p->pin_bit_mask;
	write_32bit_mmio_register(&pin_gpio_port_p->reg_ODR, reg_value);
	break;

    default:
	FDC_ASSERT(pin_info_p->pin_pull_mode == PIN_PULL_NONE,
		   pin_info_p->pin_pull_mode, pin_info_p);
    }

    /*
     * Set initial value of pin to "deasserted" if output pin:
     */
    if (is_output) {
	volatile uint32_t *data_reg_addr =
		&pin_gpio_port_p->reg_DATA_bits[pin_info_p->pin_bit_mask];

        reg_value = read_32bit_mmio_register(data_reg_addr);
	if (pin_info_p->pin_is_active_high) {
	    reg_value &= ~pin_info_p->pin_bit_mask;
        } else {
	    reg_value |= pin_info_p->pin_bit_mask;
	}
	write_32bit_mmio_register(data_reg_addr, reg_value);
    }

    /*
     * Disable analog mode for pin:
     */
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_AMSEL);
    reg_value &= ~pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(&pin_gpio_port_p->reg_AMSEL, reg_value);

#if 0
    /*
     * Set pin strength:
     */
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_DR8R);
    reg_value &= ~pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(&pin_gpio_port_p->reg_DR8R, reg_value);
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_SLR);
    reg_value &= ~pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(&pin_gpio_port_p->reg_SLR, reg_value);
#endif

    /*
     * Enable pin as a digital input or output signal:
     */
    reg_value = read_32bit_mmio_register(&pin_gpio_port_p->reg_DEN);
    reg_value |= pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(&pin_gpio_port_p->reg_DEN, reg_value);
}


void
activate_output_pin(const struct pin_config_info *pin_info_p)
{
    uint32_t reg_value;
    volatile struct gpio_port *pin_gpio_port_p = pin_info_p->pin_gpio_port_p;

#   ifdef DEBUG
    reg_value = read_32bit_mmio_register(
                            &pin_gpio_port_p->reg_DIR);

    FDC_ASSERT(
        reg_value & pin_info_p->pin_bit_mask,
        pin_info_p, reg_value);

    FDC_ASSERT(
        pin_info_p->pin_bit_mask <= 0xff,
        pin_info_p->pin_bit_mask, pin_info_p);
#   endif

    if (pin_info_p->pin_is_active_high) {
        reg_value = pin_info_p->pin_bit_mask;
    } else {
        reg_value = ~pin_info_p->pin_bit_mask;
    }

