jgrivera67/McRTOS/src/BoardSupport/LM4F120-LaunchPad/lm4f120_soc_hardware_abstractions.c
    write_32bit_mmio_register(
	&pin_gpio_port_p->reg_DATA_bits[pin_info_p->pin_bit_mask],
	reg_value);
}


void
deactivate_output_pin(const struct pin_config_info *pin_info_p)
{
    uint32_t reg_value;
    volatile struct gpio_port *pin_gpio_port_p = pin_info_p->pin_gpio_port_p;

#   ifdef DEBUG
    reg_value = read_32bit_mmio_register(
                            &pin_gpio_port_p->reg_DIR);

    FDC_ASSERT(
        reg_value & pin_info_p->pin_bit_mask,
        reg_value, pin_info_p->pin_bit_mask);

    FDC_ASSERT(
        pin_info_p->pin_bit_mask <= 0xff,
        pin_info_p->pin_bit_mask, pin_info_p);
#   endif

    if (pin_info_p->pin_is_active_high) {
        reg_value = ~pin_info_p->pin_bit_mask;
    } else {
        reg_value = pin_info_p->pin_bit_mask;
    }

    write_32bit_mmio_register(
	&pin_gpio_port_p->reg_DATA_bits[pin_info_p->pin_bit_mask],
	reg_value);
}


void
toggle_output_pin(const struct pin_config_info *pin_info_p)
{
    uint32_t reg_value;
    volatile struct gpio_port *pin_gpio_port_p = pin_info_p->pin_gpio_port_p;

#   ifdef DEBUG
    reg_value = read_32bit_mmio_register(
                            &pin_gpio_port_p->reg_DIR);

    FDC_ASSERT(
        reg_value & pin_info_p->pin_bit_mask,
        pin_info_p, reg_value);

    FDC_ASSERT(
        pin_info_p->pin_bit_mask <= 0xff,
        pin_info_p->pin_bit_mask, pin_info_p);
#   endif

    volatile uint32_t *data_reg_addr =
	&pin_gpio_port_p->reg_DATA_bits[pin_info_p->pin_bit_mask];

    reg_value = read_32bit_mmio_register(data_reg_addr);
    reg_value ^= pin_info_p->pin_bit_mask;
    write_32bit_mmio_register(data_reg_addr, reg_value);
}


bool
read_input_pin(const struct pin_config_info *pin_info_p)
{
    uint32_t reg_value;
    volatile struct gpio_port *pin_gpio_port_p = pin_info_p->pin_gpio_port_p;

#   ifdef DEBUG
    reg_value = read_32bit_mmio_register(
                            &pin_gpio_port_p->reg_DIR);

    FDC_ASSERT(
        (reg_value & pin_info_p->pin_bit_mask) == 0,
        pin_info_p, reg_value);

    FDC_ASSERT(
        pin_info_p->pin_bit_mask <= 0xff,
        pin_info_p->pin_bit_mask, pin_info_p);
#   endif

    reg_value = read_32bit_mmio_register(
			&pin_gpio_port_p->reg_DATA_bits[pin_info_p->pin_bit_mask]);

    return (reg_value & pin_info_p->pin_bit_mask) != 0;
}


void
toggle_heartbeat_led(void)
{
    toggle_rgb_led(LED_COLOR_BLUE);
}

static uint32_t g_before_debugger_led_color = LED_COLOR_BLACK;

void
turn_on_debugger_led(void)
{
    g_before_debugger_led_color = set_rgb_led_color(LED_COLOR_RED);
}


void
turn_off_debugger_led(void)
{
    set_rgb_led_color(g_before_debugger_led_color);
}


void
uart_init(
    const struct uart_device *uart_device_p,
    uint32_t baud_rate,
    uint8_t mode)
{
    uint32_t reg_value;
    cpu_id_t cpu_id = SOC_GET_CURRENT_CPU_ID();

    FDC_ASSERT(
        uart_device_p->urt_signature == UART_DEVICE_SIGNATURE,
        uart_device_p->urt_signature, uart_device_p);

    struct uart_device_var *uart_var_p = uart_device_p->urt_var_p;
    volatile struct uart *uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;
    volatile struct gpio_port *uart_gpio_port_p = uart_device_p->urt_gpio_port_p;

    FDC_ASSERT(!uart_var_p->urt_initialized, uart_device_p, 0);
    FDC_ASSERT(mode == 0, mode, uart_device_p);
    FDC_ASSERT_CPU_INTERRUPTS_DISABLED();

    /*
     * Enable clock for the UART:
     */
    reg_value = read_32bit_mmio_register(&SYSCTL_RCGC1_R);
    reg_value |= uart_device_p->urt_mmio_clock_gate_mask;
    write_32bit_mmio_register(&SYSCTL_RCGC1_R, reg_value);

    /*
     * Disable UART, while it is being configured:
     */
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_CTL);
    reg_value &= ~UART_CTL_UARTEN;
    write_32bit_mmio_register(&uart_mmio_registers_p->reg_CTL, reg_value);

    /*
     * Set baud rate divisor integer part:
     */
    reg_value = CALC_BAUD_RATE_DIVISOR_INT_PART(
		    CPU_CLOCK_FREQ_IN_HZ, baud_rate);
    write_32bit_mmio_register(&uart_mmio_registers_p->reg_IBRD, reg_value);

    /*
     * Set baud rate divisor fractional part:
     */
    reg_value = CALC_BAUD_RATE_DIVISOR_FRAC_PART(
		    CPU_CLOCK_FREQ_IN_HZ, baud_rate);
    write_32bit_mmio_register(&uart_mmio_registers_p->reg_FBRD, reg_value);

    /*
     * Configure the uart for 8-bit mode, no parity, 1 stop bit, FIFOs:
     */
    write_32bit_mmio_register(
	&uart_mmio_registers_p->reg_LCRH,
	UART_LCRH_WLEN_8 | UART_LCRH_FEN);

    /*
     * Configure Tx and Rx pins:
     * - Enable alternate function for corresponding GPIO port pins
     * - Select UART functions for pins
     * - Disable analog functionality for pins
     * - Enable digital I/O for pins
     */

    uint32_t tx_rx_pins_bit_mask =
	(BIT(uart_device_p->urt_tx_pin_bit_index) |
	 BIT(uart_device_p->urt_rx_pin_bit_index));

    reg_value = read_32bit_mmio_register(&uart_gpio_port_p->reg_AFSEL);
    reg_value |= tx_rx_pins_bit_mask;
    write_32bit_mmio_register(&uart_gpio_port_p->reg_AFSEL, reg_value);

    reg_value = read_32bit_mmio_register(&uart_gpio_port_p->reg_PCTL);
    SET_BIT_FIELD(
        reg_value,
        GPIO_PCTL_PIN_MUX_MASK(uart_device_p->urt_tx_pin_bit_index),
        GPIO_PCTL_PIN_MUX_SHIFT(uart_device_p->urt_tx_pin_bit_index),
        uart_device_p->urt_mux_function_selector);
    SET_BIT_FIELD(
        reg_value,
        GPIO_PCTL_PIN_MUX_MASK(uart_device_p->urt_rx_pin_bit_index),
        GPIO_PCTL_PIN_MUX_SHIFT(uart_device_p->urt_rx_pin_bit_index),
        uart_device_p->urt_mux_function_selector);
    write_32bit_mmio_register(&uart_gpio_port_p->reg_PCTL, reg_value);

    reg_value = read_32bit_mmio_register(&uart_gpio_port_p->reg_AMSEL);
    reg_value &= ~tx_rx_pins_bit_mask;
    write_32bit_mmio_register(&uart_gpio_port_p->reg_AMSEL, reg_value);

    reg_value = read_32bit_mmio_register(&uart_gpio_port_p->reg_DEN);
    reg_value |= tx_rx_pins_bit_mask;
    write_32bit_mmio_register(&uart_gpio_port_p->reg_DEN, reg_value);

    /*
     * Enable UART:
     */
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_CTL);
    reg_value |= UART_CTL_UARTEN;
    write_32bit_mmio_register(&uart_mmio_registers_p->reg_CTL, reg_value);

