jgrivera67/McRTOS/src/BoardSupport/LM4F120-LaunchPad/lm4f120_soc_hardware_abstractions.c
    /*
     * Initialize transmit queue:
     */
    rtos_k_byte_circular_buffer_init(
        uart_device_p->urt_transmit_queue_name_p,
        UART_TRANSMIT_QUEUE_SIZE_IN_BYTES,
        uart_device_p->urt_transmit_queue_storage_p,
        NULL,
        cpu_id,
        &uart_var_p->urt_transmit_queue);

    /*
     * Initialize receive queue:
     */
    rtos_k_byte_circular_buffer_init(
        uart_device_p->urt_receive_queue_name_p,
        UART_RECEIVE_QUEUE_SIZE_IN_BYTES,
        uart_device_p->urt_receive_queue_storage_p,
        NULL,
        cpu_id,
        &uart_var_p->urt_receive_queue);

    /*
     * Register McRTOS interrupt handler
     */
    rtos_k_register_interrupt(
        &uart_device_p->urt_rtos_interrupt_params,
        uart_device_p->urt_rtos_interrupt_pp);

    DBG_ASSERT(
        *uart_device_p->urt_rtos_interrupt_pp != NULL,
        uart_device_p->urt_rtos_interrupt_pp, uart_device_p);

    uart_var_p->urt_initialized = true;
}


static void
uart_stop(
    const struct uart_device *uart_device_p)
{
    uint32_t reg_value;
    struct uart_device_var *uart_var_p = uart_device_p->urt_var_p;
    volatile struct uart *uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;

    /*
     * Disable UART:
     */
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_CTL);
    reg_value &= ~UART_CTL_UARTEN;
    write_32bit_mmio_register(&uart_mmio_registers_p->reg_CTL, reg_value);

    /*
     * Disable clock for the UART:
     */
    reg_value = read_32bit_mmio_register(&SYSCTL_RCGC1_R);
    reg_value &= ~uart_device_p->urt_mmio_clock_gate_mask;
    write_32bit_mmio_register(&SYSCTL_RCGC1_R, reg_value);

    uart_var_p->urt_initialized = false;
}

/**
 * UART common interrupt handler with interrupts enabled
 */
void
lm4f120_uart_interrupt_e_handler(
    struct rtos_interrupt *rtos_interrupt_p)
{
    FDC_ASSERT_RTOS_INTERRUPT_E_HANDLER_PRECONDITIONS(rtos_interrupt_p);

    const struct uart_device *uart_device_p =
        (struct uart_device *)rtos_interrupt_p->int_arg_p;

    DBG_ASSERT(
        uart_device_p->urt_signature == UART_DEVICE_SIGNATURE,
        uart_device_p->urt_signature, uart_device_p);

    uint32_t reg_value;
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    volatile struct uart *uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;

    DBG_ASSERT(
        uart_mmio_registers_p == (volatile struct uart *)UART0_BASE ||
        uart_mmio_registers_p == (volatile struct uart *)UART1_BASE ||
        uart_mmio_registers_p == (volatile struct uart *)UART2_BASE,
        uart_mmio_registers_p, uart_device_p);

    DBG_ASSERT(
        uart_var_p->urt_initialized, uart_device_p, 0);

    uint32_t reg_mis_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_MIS);
    uint32_t reg_fr_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_FR);

    /*
     * Only one or more of the following UART interrupts is expected:
     */
    FDC_ASSERT(
        (reg_mis_value &
	 ~(UART_MIS_TXMIS | UART_MIS_RXMIS | UART_MIS_RTMIS)) == 0,
        reg_mis_value, uart_device_p);

    if ((reg_mis_value & UART_MIS_TXMIS) != 0) {
	/*
	 * "Tx FIFO not full" interrupt:
	 */
	unsigned int bytes_transmitted_count = 0;

	FDC_ASSERT((reg_fr_value & UART_FR_TXFF) == 0,
		   reg_fr_value, uart_device_p);

	/*
	 * Clear (acknowledge) the interrupt source:
	 */
	write_32bit_mmio_register(&uart_mmio_registers_p->reg_ICR, UART_ICR_TXIC);

	/*
	 * Fill the Tx FIFO as much as possible:
	 */
	do {
	    uint8_t byte_to_transmit;

	    bool entry_read = rtos_k_byte_circular_buffer_read(
				&uart_var_p->urt_transmit_queue,
				&byte_to_transmit,
				false);

	    if (!entry_read) {
		break;
	    }

	    /*
	     * Write the next byte to transmit, to clear the interrupt source:
	     */
	    write_32bit_mmio_register(&uart_mmio_registers_p->reg_DR,
				      byte_to_transmit);
	    bytes_transmitted_count++;
	    reg_fr_value = read_32bit_mmio_register(
				&uart_mmio_registers_p->reg_FR);
	} while ((reg_fr_value & UART_FR_TXFF) == 0);

	DBG_ASSERT(
	    bytes_transmitted_count <= UART_TX_FIFO_SIZE,
	    bytes_transmitted_count, uart_device_p);

	if (bytes_transmitted_count == 0) {
	    /*
	     * If nothing was transmitted, disable "Tx FIFO not full" interrupt:
	     */
	    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_IM);
	    reg_value &= ~UART_IM_TXIM;
	    write_32bit_mmio_register(&uart_mmio_registers_p->reg_IM, reg_value);
	}
    }

    if ((reg_mis_value & (UART_MIS_RXMIS | UART_MIS_RTMIS)) != 0) {
	/*
	 * "Rx FIFO not empty" interrupts:
	 */
	unsigned int bytes_received_count = 0;

	FDC_ASSERT((reg_fr_value & UART_FR_RXFE) == 0,
		   reg_fr_value, uart_device_p);

	/*
	 * Clear (acknowledge) the interrupt source:
	 */
	write_32bit_mmio_register(&uart_mmio_registers_p->reg_ICR,
				  UART_ICR_RXIC | UART_ICR_RTIC);

	/*
	 * Drain the Rx FIFO as much as possible:
	 */
	do {
	    /*
	     * Read the next byte received, to clear the interrupt source:
	     */
	    uint8_t byte_received = read_32bit_mmio_register(
					&uart_mmio_registers_p->reg_DR);

	    bool entry_written = rtos_k_byte_circular_buffer_write(
				    &uart_var_p->urt_receive_queue,
				    byte_received,
				    false);

	    if (!entry_written) {
		uart_var_p->urt_received_bytes_dropped ++;
		break;
	    }

	    bytes_received_count++;
	    reg_fr_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_FR);
	} while ((reg_fr_value & UART_FR_RXFE) == 0);

	DBG_ASSERT(
	    bytes_received_count <= UART_TX_FIFO_SIZE,
	    bytes_received_count, uart_device_p);

	if (bytes_received_count == 0) {
	    /*
	     * If the software receive queue is full, disable the
	     * "Rx FIFO not empty" interrupts:
	     *
	     * NOTE: We need to do this as the interrupt is still asserted.
	     * These interrupts will be re-enabled when there is room
	     * in the receive queue.
	     */
	    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_IM);
	    reg_value &= ~UART_IM_RXIM;
	    write_32bit_mmio_register(&uart_mmio_registers_p->reg_IM, reg_value);
	}
    }
}

/**
 * Enqueue a character for transmission over a UART serial port, blocking the
 * caller on a condvar if the transmit queue is full, if the caller is a thread.
 */
void
uart_putchar(
    _IN_ const struct uart_device *uart_device_p,
    _IN_ uint8_t c)
{
    uint32_t reg_value;
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    volatile struct uart *uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;

    DBG_ASSERT(uart_var_p->urt_initialized, uart_var_p, uart_device_p);

    DBG_ASSERT_PRIVILEGED_CPU_MODE_AND_INTERRUPTS_ENABLED();

    if (rtos_k_caller_is_thread()) {
	bool entry_written =
	    rtos_k_byte_circular_buffer_write(
		&uart_var_p->urt_transmit_queue, c, true);

